# Константы для длины текстовых полей
TEXT_LENGTH = 254  # Максимальная длина текста для описания рецепта
LENGTH_USERNAME = 150  # Максимальная длина имени пользователя
FIELD_NAME_LENGTH = 150  # Максимальная длина поля имени

# Константы для значений, связанных с ингредиентами
MIN_AMOUNT = 1  # Минимальное количество ингредиента
MAX_AMOUNT = 5000  # Максимальное количество ингредиента


# Константы для времени приготовления
MIN_COOKING_TIME = 1  # Минимальное время приготовления в минутах


# Константы для постраничного вывода
PAGE_SIZE = 5  # Размер страницы для постраничного вывода
